app/controllers/authors_controller.rb

INSERT INTO "authors" ("created_at", "email", "first_name", "last_name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-07-28 12:52:03.023215"], ["email", "dpressedSnake@yahoo.com"], ["first_name", "Emily"], ["last_name", "Dickinson"], ["updated_at", "2014-07-28 12:52:03.023215"]]
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save

UPDATE "authors" SET "email" = ?, "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "authors"."id" = 8  [["email", "lalalalaLA@yahoo.com"], ["first_name", "Bored"], ["last_name", "Now"], ["updated_at", "2014-07-29 13:01:49.773183"]]
---
  def update
    respond_to do |format|
      if @author.update(author_params)