app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def experiment
    @posts = Post.all

SELECT "posts".* FROM "posts"
---
  def play
    @posts = Post.all

SELECT "posts".* FROM "posts"
---
 def test
    @posts = Post.all

SELECT  "posts".* FROM "posts"  WHERE "posts"."title" = 'Earl' LIMIT 1
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 11]]
---
  def persistence
    x=Post.all.find_by(title: 'John')
    x.destroy

INSERT INTO "posts" ("body", "created_at", "starred", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Vito"], ["created_at", "2014-07-30 15:55:10.020239"], ["starred", "f"], ["title", "Otis"], ["updated_at", "2014-07-30 15:55:10.020239"]]
---
  def fakerMaker
    100.times do |post|
      title = "#{Faker::Name.first_name}"
      body = "#{Faker::Name.first_name}"
      Post.create(
      :title => title,
      :body => body,
      :starred => 0
      )

INSERT INTO "posts" ("body", "created_at", "starred", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Fantasy"], ["created_at", "2014-07-30 20:52:41.539334"], ["starred", "t"], ["title", "Final"], ["updated_at", "2014-07-30 20:52:41.539334"]]
SELECT  "posts".* FROM "posts"  WHERE (title like J%)  ORDER BY "posts"."id" ASC LIMIT 1
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = 745  [["title", "Cinderella"], ["updated_at", "2014-07-30 21:14:29.056122"]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 649]]
SELECT  "posts".* FROM "posts"   ORDER BY "posts"."id" ASC LIMIT 1
---
  def fakerSaver
    x=Post.create(
      title: 'Final',
      body: 'Fantasy',
      starred: 1
      )
    p x

    y=Post.new(
      title: 'Cindy'
      )
    y.save
    y.title = 'Cinderella'
    y.save
    p y

    v=Post.all.find_by(title: 'Cinderella')
    v.update_attributes(
      title: 'Candy Corn'
      )
    p v

    Post.update_all "starred='true'"

    del=Post.find_by(title: 'Final')
    del.destroy

    p Post.all

SELECT  "posts".* FROM "posts"  LIMIT 4
---
  def query
    x=Post.all.limit(4)

INSERT INTO "posts" ("body", "created_at", "starred", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "EAT! KILL! SLEEP!"], ["created_at", "2014-07-28 12:31:45.249782"], ["starred", "t"], ["title", "Demonchild"], ["updated_at", "2014-07-28 12:31:45.249782"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["title", "Daily"], ["updated_at", "2014-07-28 12:36:27.950919"]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)